In [146]:
import pandas as pd
import logging

logging.basicConfig(level=logging.INFO)

In [147]:
url =  "https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes"

In [148]:
def scrape(url):
  logging.info(f"Scraping website with url: '{url}' ...")
  return pd.read_html(url, header=None)

In [149]:
dfs = scrape(url)[1]

INFO:root:Scraping website with url: 'https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes' ...

In [150]:
dfs

   No.                        Nama  ...       Kebangsaan      Sumber kekayaan
0  NaN                  Jeff Bezos  ...  Amerika Serikat               Amazon
1  NaN                   Elon Musk  ...  Amerika Serikat        Tesla, SpaceX
2  NaN  Bernard Arnault & keluarga  ...          Prancis                 LVMH
3  NaN                  Bill Gates  ...  Amerika Serikat            Microsoft
4  NaN             Mark Zuckerberg  ...  Amerika Serikat       Meta Platforms
5  NaN              Warren Buffett  ...  Amerika Serikat   Berkshire Hathaway
6  NaN               Larry Ellison  ...  Amerika Serikat   Oracle Corporation
7  NaN                  Larry Page  ...  Amerika Serikat        Alphabet Inc.
8  NaN                 Sergey Brin  ...  Amerika Serikat        Alphabet Inc.
9  NaN               Mukesh Ambani  ...            India  Reliance Industries

[10 rows x 6 columns]

In [151]:
dfs['Kekayaan Bersih (USD)'] = dfs['Kekayaan bersih (USD)'].str.replace('$','')

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  """Entry point for launching an IPython kernel.

In [152]:
dfs['Kekayaan Bersih (USD)']

0     177 miliar
1     151 miliar
2     150 miliar
3     124 miliar
4      97 miliar
5      96 miliar
6      93 miliar
7    91.5 miliar
8      89 miliar
9    84.5 miliar
Name: Kekayaan Bersih (USD), dtype: object

In [153]:
import re

In [154]:
def is_money_miliar(string_money):
    # akan return True jika terdeteksi data yang berakhiran miliar
    return string_money.lower().endswith("miliar")

In [155]:
def transform_money_format(string_money):
    # mengganti koma menjadi titik dan menghilangkan spasi
    half_clean_string = string_money.lower().replace(",", ".").replace(" ", "").replace("$","")
    # mendeteksi string M atau miliar dan J atau juta dan menggantinya dengan string kosong
    return re.sub(r"[?\[M\]miliar|\[J\]juta]|\$", "", half_clean_string)

In [156]:
def transform(df, tahun):
    logging.info("Transforming DataFrame ...")

    columns_mapping = {
        "No.": "no.",
        "Nama": "nama",
        "Usia": "usia",
        "Kebangsaan": "kebangsaan",
        "Sumber kekayaan": "sumber_kekayaan",
        "Kekayaan Bersih (USD)" : "kekayaan_bersih_usd"
    }

  # mengganti nama2 column sebelumnya sesuai kebutuhan
    renamed_df = df.rename(columns=columns_mapping)

    # menambahkan column tahun dan memberinya value yang berasal dari parameter tahun
    renamed_df["tahun"] = tahun
    
    # Memberi nilai pada kekayaan_bersih_usd_juta dgn percabangan if else
    # Jika terdeteksi string miliar (is_money_miliar), maka dikali 1000 dan string miliar atau juta dihilangkan
    # Jika tidak, maka hanya menghilangkan string juta saja
    renamed_df["kekayaan_bersih_usd_juta"] = renamed_df["kekayaan_bersih_usd"].apply(
        lambda value: float(transform_money_format(value)) * 1000 if is_money_miliar(value) else float(transform_money_format(value))
    )

    return renamed_df[["no.", "tahun", "nama", "usia","kebangsaan","sumber_kekayaan","kekayaan_bersih_usd_juta"]]

In [157]:
df_2021 = transform(dfs, 2021)

INFO:root:Transforming DataFrame ...

In [158]:
df_2021

   no.  tahun  ...      sumber_kekayaan  kekayaan_bersih_usd_juta
0  NaN   2021  ...               Amazon                  177000.0
1  NaN   2021  ...        Tesla, SpaceX                  151000.0
2  NaN   2021  ...                 LVMH                  150000.0
3  NaN   2021  ...            Microsoft                  124000.0
4  NaN   2021  ...       Meta Platforms                   97000.0
5  NaN   2021  ...   Berkshire Hathaway                   96000.0
6  NaN   2021  ...   Oracle Corporation                   93000.0
7  NaN   2021  ...        Alphabet Inc.                   91500.0
8  NaN   2021  ...        Alphabet Inc.                   89000.0
9  NaN   2021  ...  Reliance Industries                   84500.0

[10 rows x 7 columns]

In [159]:
df_2021['no.'] = [1,2,3,4,5,6,7,8,9,10]

In [160]:
df_2021

   no.  tahun  ...      sumber_kekayaan  kekayaan_bersih_usd_juta
0    1   2021  ...               Amazon                  177000.0
1    2   2021  ...        Tesla, SpaceX                  151000.0
2    3   2021  ...                 LVMH                  150000.0
3    4   2021  ...            Microsoft                  124000.0
4    5   2021  ...       Meta Platforms                   97000.0
5    6   2021  ...   Berkshire Hathaway                   96000.0
6    7   2021  ...   Oracle Corporation                   93000.0
7    8   2021  ...        Alphabet Inc.                   91500.0
8    9   2021  ...        Alphabet Inc.                   89000.0
9   10   2021  ...  Reliance Industries                   84500.0

[10 rows x 7 columns]

In [161]:
pip install psycopg2-binary==2.8.6

Collecting psycopg2-binary==2.8.6
  Downloading psycopg2_binary-2.8.6-cp37-cp37m-manylinux1_x86_64.whl (3.0 MB)
     |████████████████████████████████| 3.0 MB 5.0 MB/s
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.8.6

In [162]:
from sqlalchemy import create_engine

In [171]:
DB_NAME = "postgres"
DB_USER = "user1"
DB_PASSWORD = "user1"
DB_HOST = "104.197.148.144"
DB_PORT = "5432"
CONNECTION_STRING = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
TABLE_NAME = "rizqi_orang_terkaya_forbes"

In [172]:
CONNECTION_STRING

'postgresql://user1:user1@104.197.148.144:5432/postgres'

In [173]:
def write_to_postgres(df, db_name, table_name, connection_string):
    engine = create_engine(connection_string)
    logging.info(f"Writing dataframe to database: '{db_name}', table: '{table_name}' ...")
    df.to_sql(name = table_name, con=engine, if_exists="replace", index=False)

In [174]:
write_to_postgres(df=df_2021, db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

INFO:root:Writing dataframe to database: 'postgres', table: 'rizqi_orang_terkaya_forbes' ...

In [175]:
def read_from_postgres(db_name, table_name, connection_string):
    engine = create_engine(connection_string)

    logging.info(f"Reading postgres database: '{db_name}', table: '{table_name}' ...")
    return pd.read_sql_table(table_name, con=engine)

In [176]:
result_df = read_from_postgres(db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

INFO:root:Reading postgres database: 'postgres', table: 'rizqi_orang_terkaya_forbes' ...

In [177]:
print("Daftar Miliarder Forbes:")
print(result_df.to_string())

Daftar Miliarder Forbes:
   no.  tahun                        nama  usia       kebangsaan      sumber_kekayaan  kekayaan_bersih_usd_juta
0    1   2021                  Jeff Bezos    57  Amerika Serikat               Amazon                  177000.0
1    2   2021                   Elon Musk    49  Amerika Serikat        Tesla, SpaceX                  151000.0
2    3   2021  Bernard Arnault & keluarga    72          Prancis                 LVMH                  150000.0
3    4   2021                  Bill Gates    65  Amerika Serikat            Microsoft                  124000.0
4    5   2021             Mark Zuckerberg    36  Amerika Serikat       Meta Platforms                   97000.0
5    6   2021              Warren Buffett    90  Amerika Serikat   Berkshire Hathaway                   96000.0
6    7   2021               Larry Ellison    76  Amerika Serikat   Oracle Corporation                   93000.0
7    8   2021                  Larry Page    48  Amerika Serikat        Alphabet Inc.                   91500.0
8    9   2021                 Sergey Brin    47  Amerika Serikat        Alphabet Inc.                   89000.0
9   10   2021               Mukesh Ambani    63            India  Reliance Industries                   84500.0